Terraform plan result:

```
data.aws_s3_bucket.lambda_code: Reading...
aws_cloudwatch_log_group.image_processor_logs: Refreshing state... [id=/aws/lambda/emenu-image-processor-dev]
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_cloudwatch_log_group.presigned_url_generator_logs: Refreshing state... [id=/aws/lambda/emenu-presigned-url-generator-dev]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_iam_role.presigned_url_role: Refreshing state... [id=presigned-url-role-dev]
aws_iam_role.image_processor_role: Refreshing state... [id=image-processor-role-dev]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_s3_bucket.restaurant_assets: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket.dish_images: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250929095628385500000001]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250929095628385500000002]
aws_iam_role_policy.emenu_server_ses_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ses_access]
data.aws_s3_bucket.lambda_code: Read complete after 2s [id=emenu-lambda-code-bucket]
data.aws_s3_object.emenu_server_code: Reading...
data.aws_s3_object.emenu_post_confirmation_code: Reading...
data.aws_s3_object.presigned_url_generator_code: Reading...
data.aws_s3_object.image_processor_code: Reading...
data.aws_s3_object.layer_code: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.emenu_server_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/emenu_server/emenu_server.zip]
data.aws_s3_object.presigned_url_generator_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/presigned_url_generator/presigned_url_generator.zip]
data.aws_s3_object.image_processor_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/image_processor/image_processor.zip]
data.aws_s3_object.emenu_post_confirmation_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/emenu_post_confirmation/emenu_post_confirmation.zip]
data.aws_s3_object.layer_code: Read complete after 0s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ]
aws_s3_bucket_public_access_block.restaurant_assets_pab: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_versioning.restaurant_assets_versioning: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_server_side_encryption_configuration.restaurant_assets_encryption: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_cors_configuration.restaurant_assets_cors: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_server_side_encryption_configuration.dish_images_encryption: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.presigned_url_policy: Refreshing state... [id=presigned-url-role-dev:presigned-url-policy-dev]
aws_iam_role_policy.image_processor_policy: Refreshing state... [id=image-processor-role-dev:image-processor-policy-dev]
aws_s3_bucket_public_access_block.dish_images_pab: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_cors_configuration.dish_images_cors: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_versioning.dish_images_versioning: Refreshing state... [id=emenu-dish-images-dev]
aws_lambda_function.image_processor: Refreshing state... [id=emenu-image-processor-dev]
aws_lambda_function.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_policy.restaurant_assets_policy: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_policy.dish_images_policy: Refreshing state... [id=emenu-dish-images-dev]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/waiter]
aws_iam_role_policy.emenu_server_cognito_admin_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_cognito_admin_access]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/boss]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=19kbapekjfmn2jkue74baferh5]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=4l90vqi7nfam318ci1tml91j3n]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/demo]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_permission.allow_s3_invoke_dish_images: Refreshing state... [id=AllowExecutionFromDishImagesBucket]
aws_lambda_function_url.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_appsync_api_key.emenu_api_key: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4]
aws_s3_bucket_notification.image_upload_notification: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_notification.dish_image_upload_notification: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-emenu_datasource]
aws_appsync_resolver.dish_dishType_field: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Dish-dishType]
aws_appsync_resolver.toggle_dish_type_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishTypeStatus]
aws_appsync_resolver.update_restaurant_subscription_plan_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantSubscriptionPlan]
aws_appsync_resolver.get_user_by_cognito_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUserByCognito]
aws_appsync_resolver.update_restaurant_info_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantInfo]
aws_appsync_resolver.register_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-registerWaiter]
aws_appsync_resolver.create_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDish]
aws_appsync_resolver.checkout_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-checkoutOrder]
aws_appsync_resolver.update_order_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateOrderStatus]
aws_appsync_resolver.toggle_dish_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishStatus]
aws_appsync_resolver.create_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDishType]
aws_appsync_resolver.list_dish_types_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishTypes]
aws_appsync_resolver.place_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-placeOrder]
aws_appsync_resolver.delete_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDish]
aws_appsync_resolver.get_restaurant_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getRestaurant]
aws_appsync_resolver.list_orders_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listOrders]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createRestaurant]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishes]
aws_appsync_resolver.list_waiters_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listWaiters]
aws_appsync_resolver.delete_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDishType]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUser]
aws_appsync_resolver.update_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDish]
aws_appsync_resolver.update_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishType]
aws_appsync_resolver.invite_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-inviteWaiter]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appsync_api_key.emenu_api_key will be updated in-place
  ~ resource "aws_appsync_api_key" "emenu_api_key" {
      ~ expires     = "2026-11-16T00:00:00Z" -> (known after apply)
        id          = "lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4"
        # (4 unchanged attributes hidden)
    }

  # aws_appsync_graphql_api.emenu_apis will be updated in-place
  ~ resource "aws_appsync_graphql_api" "emenu_apis" {
        id                            = "lwxrbthg3naonl3t7x5bydvhhy"
        name                          = "emenu-apis"
      ~ schema                        = <<-EOT
            # ====================================================================
            # ENUMS & UTILITIES
            # ====================================================================
            
            enum Role {
              boss
              waiter
            }
            
            enum SubscriptionPlan {
              BASIC
              PREMIUM
            }
            
            enum OrderStatus {
              PENDING
              CONFIRMED # 已确认，正在制作
              COMPLETED # 已完成/结账
              CANCELLED
            }
            
            # ====================================================================
            # CORE ENTITY TYPES (用于读取)
            # ====================================================================
            
            # 用户 Type (用于身份和权限管理)
            type User {
              id: ID! # Mongoose _id
              cognitoId: String # Cognito Sub ID
              email: String!
              role: Role!
              restaurantId: ID # 关联的餐厅 ID (Waiter 必有)
              isDeleted: Boolean! # 软删除标记
              inviteToken: String # 仅 waiter 用户有效
              status: String # waiter registration status: 'pending', 'active', 'disabled', etc.
              createdAt: String # 用户创建时间（ISO 格式）
              updatedAt: String # 用户更新时间（ISO 格式）
            }
            
            # Waiter registration response (API Key accessible)
            type RegisterWaiterPayload @aws_api_key {
              id: ID!
              cognitoId: String
              email: String!
              role: Role!
              status: String!
              createdAt: String!
            }
            
            # 餐厅 Type (包含订阅和限额信息)
            type Restaurant {
              id: ID! # Mongoose _id
              bossId: ID!
              name: String!
          -   image: String
          +   logoUrl: String
              address: String
              phone: String
              subscriptionPlan: SubscriptionPlan!
              subscriptionExpiry: String! # 到期日，ISO 格式，比如 "2025-12-31"
            
              # 业务限额字段 (从 MongoDB 动态读取)
              dishTypeLimit: Int!
              dishLimit: Int!
              waiterLimit: Int!
              
              # 关联: waiters 数组（存储 waiter 的 _id，查询时可 populate）
              waiters: [User]
            }
            
            # DishType Type
            type DishType {
              id: ID!                  # Mongoose _id
              restaurantId: ID!
              name: String!
              alias: String            # Alias/Sub-title
              sortOrder: Int           # Display order (for UI control)
              isDeleted: Boolean!      # Data control (soft delete)
              isActive: Boolean!       # Business control (active/inactive)
              createdAt: String!
              updatedAt: String!
            }
            
            # Dish Type
            type Dish {
              id: ID!                  # Mongoose _id
              restaurantId: ID!
              name: String!
              price: Int!              # By cents
              imageUrl: String
              description: String      # Dish description
              sortOrder: Int           # Display order within dishType (for menu layout)
              isActive: Boolean!    # Business control: active/available to customers
              isDeleted: Boolean!      # Data control: soft delete (preserves historical orders)
            
              createdAt: String!
              updatedAt: String!
              
              dishType: DishType!      # Relationship: DishType this dish belongs to (REQUIRED - every dish must have a valid category)
            }
            
            # 订单行项目 Type (嵌入在 Order 中)
            type OrderItem {
              dishId: ID!
              name: String! # 下单时的菜品名称 (历史快照)
              price: Int! # 下单时的菜品价格 (历史快照)
              quantity: Int!
              notes: String
            }
            
            # 订单 Type
            type Order {
              id: ID! # Mongoose _id
              restaurantId: ID!
              waiterId: ID! # 下单服务员的 User ID
              tableNumber: String!
              status: OrderStatus!
              totalAmount: Int!
              createdAt: String!
              
              # 嵌入列表: 订单包含的行项目
              items: [OrderItem!] 
            }
            
            # ====================================================================
            # INPUT TYPES (用于写入/更新)
            # ====================================================================
            
            input RestaurantInput {
              name: String!
          -   image: String
          +   logoUrl: String
              address: String
              phone: String
            }
            
            input RestaurantInfoInput {
              name: String
          -   image: String
          +   logoUrl: String
              address: String
              phone: String
            }
            
            input SubscriptionUpgradeInput {
              subscriptionPlan: SubscriptionPlan!
              subscriptionExpiry: String! # 到期日期
              paymentTransactionId: String # 支付交易ID，用于记录
            }
            
            input DishTypeInput {
              name: String!
              alias: String
              sortOrder: Int
            }
            
            input DishInput {
              dishTypeId: ID!          # 必须指定分类
              name: String!
              price: Int!
          -   image: String
          +   imageUrl: String
              description: String
              sortOrder: Int           # 可选，默认追加到末尾
          -   isActive: Boolean     # 默认为 true
          +   isActive: Boolean        # 默认为 true
            }
            
            input OrderItemInput {
              dishId: ID!
              quantity: Int!
              notes: String
            }
            
            input OrderInput {
              tableNumber: String!
              items: [OrderItemInput!]!
            }
            
            # ====================================================================
            # ROOT OPERATIONS
            # ====================================================================
            
            type Query {
              getUser(id: ID!): User
              getUserByCognito(cid: ID!): User
              # 菜单查询 (Boss/Waiter)
              getRestaurant: Restaurant
              listDishTypes: [DishType]
              listDishes(dishTypeId: ID): [Dish]
              listWaiters: [User]
            
              # 订单查询
              listOrders(status: OrderStatus, dateFrom: String, dateTo: String): [Order]
            }
            
            type Mutation {
              # 餐厅与 Boss 管理
              createRestaurant(input: RestaurantInput!): Restaurant # 仅创建 BASIC 版本
              updateRestaurantInfo(input: RestaurantInfoInput!): Restaurant # 更新餐厅基本信息
              updateRestaurantSubscriptionPlan(input: SubscriptionUpgradeInput!): Restaurant # 订阅升级
              
              # invite waiter, delete waiter
              inviteWaiter(email: String!): User
              registerWaiter(token: String!, password: String!): RegisterWaiterPayload @aws_api_key # waiter registration via inviteToken (API Key access)
              deleteWaiter(id: ID!): Boolean
              activateWaiter(token: String!, password: String!): Boolean
            
              # 菜单管理
              createDishType(input: DishTypeInput!): DishType
              updateDishType(id: ID!, input: DishTypeInput!): DishType
              deleteDishType(id: ID!): DishType # 软删除，返回更新后的对象
              toggleDishTypeStatus(id: ID!, isActive: Boolean!): DishType # 切换分类状态
              
              createDish(input: DishInput!): Dish
              updateDish(id: ID!, input: DishInput!): Dish
              deleteDish(id: ID!): Dish # 软删除，返回更新后的对象
              toggleDishStatus(id: ID!, isActive: Boolean!): Dish # Switch dish availability status
            
              # 订单操作
              placeOrder(input: OrderInput!): Order
              checkoutOrder(orderId: ID!): Order
              updateOrderStatus(orderId: ID!, status: OrderStatus!): Order
            }
        EOT
        tags                          = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role_policy.presigned_url_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "presigned_url_policy" {
        id          = "presigned-url-role-dev:presigned-url-policy-dev"
        name        = "presigned-url-policy-dev"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "logs:CreateLogGroup",
                            "logs:CreateLogStream",
                            "logs:PutLogEvents",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:*:*:*"
                    },
                  ~ {
                      ~ Action   = [
                            "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.emenu_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "emenu_post_confirmation" {
        id                             = "emenu_post_confirmation"
      ~ last_modified                  = "2025-11-11T00:04:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34",
        ] -> (known after apply)
      ~ source_code_hash               = "5f5947a1ee2e7723df7bf7ec2fbeaf20" -> "50fd897321c5c888ebdb02b29a793abc"
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_server will be updated in-place
  ~ resource "aws_lambda_function" "emenu_server" {
        id                             = "emenu-server"
      ~ last_modified                  = "2025-11-13T08:58:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34",
        ] -> (known after apply)
      ~ source_code_hash               = "f89d89baa4a7e6e132a4940949d6c9ff" -> "47547001bbd926a3d86cf146fc81d9d0"
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.image_processor will be updated in-place
  ~ resource "aws_lambda_function" "image_processor" {
        id                             = "emenu-image-processor-dev"
      ~ last_modified                  = "2025-11-16T00:50:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "9f1de29540cb2d7d6a91c5a8cf19b18f-3" -> "df4bed2efe2e9cd96891e34549118c65-3"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.presigned_url_generator will be updated in-place
  ~ resource "aws_lambda_function" "presigned_url_generator" {
        id                             = "emenu-presigned-url-generator-dev"
      ~ last_modified                  = "2025-11-16T00:50:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "a6413c77fed3def0f2bc4171a48a996b" -> "379bf0f70c6b7dd25da87abe1ecfff54"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.common_mongoose_models must be replaced
-/+ resource "aws_lambda_layer_version" "common_mongoose_models" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34" -> (known after apply)
      ~ code_sha256                 = "gN912ZujhvawsVuddQZA/ifSh9GNWRG7emDqKGBVIr0=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-11T00:04:08.487+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:34" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "bedbb5d0f693994a04a611ed057de372" -> "e16bcf831ac766b3e0275b479f1a18ea" # forces replacement
      ~ source_code_size            = 2696284 -> (known after apply)
      ~ version                     = "34" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.dish_images_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "dish_images_policy" {
        id     = "emenu-dish-images-dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = "s3:GetObject"
                        Effect    = "Allow"
                        Principal = "*"
                        Resource  = "arn:aws:s3:::emenu-dish-images-dev/public/dish-images/processed/*"
                        Sid       = "PublicReadProcessedImages"
                    },
                  ~ {
                      ~ Action    = [
                            "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.restaurant_assets_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "restaurant_assets_policy" {
        id     = "emenu-restaurant-assets-dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = "s3:GetObject"
                        Effect    = "Allow"
                        Principal = "*"
                        Resource  = "arn:aws:s3:::emenu-restaurant-assets-dev/public/restaurant-logos/processed/*"
                        Sid       = "PublicReadProcessedImages"
                    },
                  ~ {
                      ~ Action    = [
                            "s3:PutObject",
                          - "s3:PutObjectAcl",
                        ]
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 9 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
